OdRxMember.init(OdString!System.Runtime.CompilerServices.IsConst*!System.Runtime.CompilerServices.IsImplicitlyDereferenced,OdRxValueType!System.Runtime.CompilerServices.IsConst*,OdRxObject!System.Runtime.CompilerServices.IsConst*)
\details
Assigns an unlocalized name, type and owner to this member.
\remarks
Initialization method used by descendants.

OdRxMember.subChildrenEx(OdArray&lt;OdSmartPtr&lt;OdRxMember&gt;,OdObjectsAllocator&lt;OdSmartPtr&lt;OdRxMember&gt;&gt;&gt;**!System.Runtime.CompilerServices.IsImplicitlyDereferenced)
\details
Adds properties in bulk.
\returns eOk if properties are added in bulk successfully, or a corresponding error type otherwise.
\remarks
pChildren array is managed by the function itself.

OdRxMember.subChildren(OdArray&lt;OdSmartPtr&lt;OdRxMember&gt;,OdObjectsAllocator&lt;OdSmartPtr&lt;OdRxMember&gt;&gt;&gt;*!System.Runtime.CompilerServices.IsImplicitlyDereferenced)
\details
Adds an array of member children.
\param children [in] An array of children.
\returns eOk if a member child array is added successfully, or a corresponding error type otherwise.
\remarks
First call to children calls subChildren, if it returned eNotApplicable then
subChildrenEx is called. subChildren() is expected to adds members children
array.

OdRxMember.subLocalName
\details
Descendants may overload localized name obtaining method.

OdRxMember.deleteMember(OdRxMember!System.Runtime.CompilerServices.IsConst*)
\details
Removes this member from the owner and fires "goodbye" reactors registered with the
OdRxMemberQueryEngine.
\param pMember [in] Property to be removed.
\remarks
This method should be used to delete properties while unloading.

OdRxMember.children
\details
Gets the array of subproperties (child properties).
\returns
Array of subproperties (child properties).
\remarks
Some properties may have child properties, e.g., "EndPoint" property of
OdDbLine has subproperties "EndPoint/X", "EndPoint/Y", "EndPoint/Z".

OdRxMember.owner
\details
Gets the owner of the property.
For the usual properties owner is the OdRxClass they are attached to.
For subproperties owner is the main property.
\returns
Owner of the property.

OdRxMember.attributes
\details
Gets the attributes that are used on some properties to modify their behavior. E.g.,
OdRxLocalizedNameAttribute defines localName().
See RxAttributes.h for more information.
\returns
Collection of property attributes.
\details
Gets the attributes that are used on some properties to modify their behavior. E.g.,
OdRxLocalizedNameAttribute defines localName().
See RxAttributes.h for more information.
\returns
Collection of property attributes.

OdRxMember.type
\details
Gets the property value type.
\returns
Property value type.

OdRxMember.localName
\details
Gets the localized name (can be loaded from resources via OdRxLocalizedNameAttribute::getLocalizedName).
\returns
Localized name of the property.

OdRxMember.name
\details
Gets the static unlocalized name of the property.
\returns
Name of the property.